#Калькулятор віку
name = input("Введіть ваше імʼя") #Просимо користувача ввести його імʼя
age = int(input("Ведіть ваш вік")) #Просимо користувача ввести його вік

month = age * 12 #Обчислювання віку в місяцях
days = age * 365 #Обчислювання віку і днях

#Виведення картки користувача
print("КАРТА КОРИСТУВАЧА")

print("=" * 30) #Використання декоративних символів

print("Імʼя користувача:", name) #Вивід імʼя
print("Вік користувача в роках:", age) #Вивід життя користувача в роках
print("Вік користувача в місяцях:", month) #Вивід життя користувача в місяцях
print("Вік користуача в днях:", days) #Вивід життя користувача в днях

print("=" * 30) #Використання декоративних символів