#Розширений калькулятор

a = float(input("Введіть перше число: ")) #Просимо користувача ввести число1 та переводимо у float
b = float(input("Введіть друге число: ")) #Просимо користувача ввести число1 та переводимо у float

print( "=" * 30 ) #Використання декоративних символів
print("Результати обчислень") #Вивід результатів
print( "-" * 30 ) #Використання декоративних символів

print("Додавання:", a + b) #Додавання
print( "-" * 30 ) #Використання декоративних символів

print("Віднімання:", a - b) #Віднімання
print( "-" * 30 ) #Використання декоративних символів

print("Множення:", a * b) #Множення
print( "-" * 30 ) #Використання декоративних символів

print("Звичайне ділення:", a / b) #Звичайне ділення
print( "=" * 30 ) #Використання декоративних символів

print("Цілочисельне ділення:", a // b) #Ціле ділення
print( "=" * 30 ) #Використання декоративних символів

print("Остача від ділення:", a % b) #Остача від ділення
print( "=" * 30 ) #Використання декоративних символів

print("Піднесення до степеня:", a ** b) #Піднесення до степеня
