#Система оцінок

grade = int(input("Введіть ваш бал (0-100): ")) #Просимо користувача ввести бал

#Перевірка діапазонів
if grade >= 90 and grade <= 100:
    print("Відмінно") #Вивід результату шкали балів
elif grade >= 75 and grade <= 89:
    print("Добре") #Вивід результату шкали балів
elif grade >= 60 and grade <= 74:
    print("Задовільно") #Вивід результату шкали балів
elif grade >= 5 and grade <= 59:
    print("Завдання виконано частково") #Вивід результату шкали балів
elif grade == 2:
    print("Завдання не виконано") #Вивід результату шкали балів
else:
    print("Некоректний бал") #Вивід якщо користувач введе некоректний бал
