#Привітання користувача
name = input("Ваше ім'я:") #Ім'я користувача
age = int(input("Ваш вік:")) #Вік користувача

next_year_age = age + 1 #Обчислюємо вік на наступний рік

print("=" * 30) #Використання декоративних символів

print("Привітання користувача") #Текстовий блок про дані користувача
print("=" * 30) #Використання декоративних символів

print("Привіт, мене звати", name) #Отримуємо ім'я користувача
print("-" * 30) #Використання декоративних символів

print("Зараз мені", age) #Отримуємо вік користквача
print("-" * 30) #Використання декоративних символів

print("Але в наступному році мені буде", next_year_age ) #Отримуємо вік користувача на наступний рік
print("-" * 30) #Використання декоративних символів